require'dxruby'
require'./game'
require'./newral'

p 'new simulation'

COOL_TIME = 2	#(秒)

game1 = Game.new()

#"AI"_thread
#"AI"のスレッドを開始
ai = Thread.new do
	p 'started thread newral'
	
	#無限ループ
	loop do
		p '>> loop in <<'
		Newral::all_thinking
		p 'resolved'
		
		#クールタイム
		p'waiting'
		sleep COOL_TIME
	end
	#ループ折り返し
	p 'end thread newral'
end

#MainLoop
Window.loop do
	#######################################################################################################################
	#更新処理
	game1.update()
	#更新処理終了###########################################################################################################
	
	#######################################################################################################################
	#描画処理
	game1.draw()
	#描画処理終了###########################################################################################################

	#デバッグ用表示
	game1.drawDebug()
	
	break if Input.keyPush?(K_ESCAPE) # Escキーで終了
end

#######################################################################################################################
#終了処理
game1.finalize()
#終了処理終了###########################################################################################################
